{"sample_weight_mode": null, "optimizer": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "name": "RMSprop", "epsilon": 1e-08}, "loss": "categorical_crossentropy", "keras_version": "1.0.5", "config": [{"config": {"name": "dense_1", "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "output_dim": 512, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "bias": true, "init": "glorot_uniform", "batch_input_shape": [null, 784]}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "b_constraint": null, "W_constraint": null, "output_dim": 512, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "b_constraint": null, "W_constraint": null, "output_dim": 10, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential"}